/*
 *
 * gcc -Wall -Wno-address-of-packed-member -g -o diag diag.c -I $PREFIX/usr/include -L $PREFIX/usr/lib64 -libumad -libmad -lm
 *
 *
 */

#include <stdio.h>
#include <errno.h>
#include <unistd.h>
#include <limits.h>	/* CHAR_BIT */
#include <arpa/inet.h>
#include <string.h>
#include <assert.h>
#include <math.h>
#include <stddef.h>

#include <infiniband/mad.h>
#include <infiniband/umad.h>

struct ib_mad {
	uint8_t      base_version;   /* 00 */
	uint8_t      mgmt_class;     /* 01 */
	uint8_t      class_version;  /* 02 */
	uint8_t      method;         /* 03 */
	uint16_t     status;         /* 04 */
	uint16_t     resv1;          /* 06 */
	uint64_t     tid;            /* 08 */
	uint16_t     attr_id;        /* 10 */
	uint16_t     resv2;          /* 12 */
	uint32_t     attr_mod;       /* 14 */
	uint64_t     vkey;	     /* 18 */
	char         data[224];      /* 20 */
} __attribute__((packed));

typedef struct {
	uint16_t	unused;
	/* bits [8-11] only */
	uint8_t		page_backward_rev;
	/* bits [0-3] only */
	uint8_t		page_current_rev;
	uint32_t	reserved;
	/* Page 0 */
	uint32_t	rq_num_lle;
	uint32_t	sq_num_lle;
	uint32_t	rq_num_lqpoe;
	uint32_t	sq_num_lqpoe;
	uint32_t	rq_num_leeoe;
	uint32_t	sq_num_leeoe;
	uint32_t	rq_num_lpe;
	uint32_t	sq_num_lpe;
	uint32_t	rq_num_wrfe;
	uint32_t	sq_num_wrfe;
	uint32_t	sq_num_mwbe;
	uint32_t	sq_num_bre;
	uint32_t	rq_num_lae;
	uint32_t	rq_num_rire;
	uint32_t	sq_num_rire;
	uint32_t	rq_num_rae;
	uint32_t	sq_num_rae;
	uint32_t	rq_num_roe;		/* NEW */
	uint32_t	sq_num_roe;
	uint32_t	sq_num_rnr;
	uint32_t	rq_num_oos;
	uint32_t	sq_num_oos;
	uint32_t	rq_num_dup;		/* NEW */
	uint32_t	sq_num_to;		/* NEW */
	uint32_t	sq_num_tree;
	uint32_t	sq_num_rree;
	uint32_t	sq_num_rabrte;
	uint32_t	rq_num_mce;
	uint32_t	rq_num_rsync;
	uint32_t	sq_num_rsync;
	uint32_t	sq_num_ldb_drops;	/* NEW */

} __attribute__((packed)) mlx_ib_transport_counters_t;

typedef struct {
	uint16_t	unused;
	/* bits [8-11] only */
	uint8_t		page_backward_rev;
	/* bits [0-3] only */
	uint8_t		page_current_rev;
	uint32_t	reserved;
	/* Page 0 */
	uint32_t	rq_num_sig_err;
	uint32_t	sq_num_sig_err;
	uint32_t	sq_num_cnak;
	uint32_t	sq_reconnect;
	uint32_t	sq_reconnect_ack;
	uint32_t	rq_open_gb;
	uint32_t	rq_num_no_dcrs;
	uint32_t	rq_num_cnak_sent;
	uint32_t	sq_reconnect_ack_bad;
	uint32_t	rq_open_gb_cnak;
	uint32_t	rq_gb_trap_cnak;
	uint32_t	rq_not_gb_connect;
	uint32_t	rq_not_gb_reconnect;
	uint32_t	rq_curr_gb_connect;
	uint32_t	rq_curr_gb_reconnect;
	uint32_t	rq_close_non_gb_gc;
	uint32_t	rq_dcr_inhale_events;
	uint32_t	rq_state_active_gb;
	uint32_t	rq_state_avail_dcrs;
	uint32_t	rq_dcr_lifo_size;
	uint32_t	sq_cnak_drop;
	uint32_t	minimum_dcrs;
	uint32_t	maximum_dcrs;
	uint32_t	max_cnak_fifo_size;
	uint32_t	rq_num_dc_cacks;
	uint32_t	sq_num_dc_cacks;

} __attribute__((packed)) mlx_hca_ext_flow_counters_t;

typedef struct {
	uint16_t	unused;
	/* bits [8-11] only */
	uint8_t		page_backward_rev;
	/* bits [0-3] only */
	uint8_t		page_current_rev;
	uint32_t	reserved;

	/* Table 915 - PCIe Performance Counters Data Layout */
	uint32_t	life_time_counter_high;
	uint32_t	life_time_counter_low;
	uint32_t	rx_errors;
	uint32_t	tx_errors;
	uint32_t	l0_to_recovery_eieos;
	uint32_t	l0_to_recovery_ts;
	uint32_t	l0_to_recovery_framing;
	uint32_t	l0_to_recovery_retrain;
	uint32_t	crc_error_dllp;
	uint32_t	crc_error_tlp;
	uint64_t	tx_overflow_buffer_pkt;
	uint32_t	outbound_stalled_reads;
	uint32_t	outbound_stalled_writes;
	uint32_t	outbound_stalled_reads_events;
	uint32_t	outbound_stalled_writes_events;
	uint64_t	tx_overflow_buffer_marked_pkt;
	uint16_t	unused2;
	uint8_t		effective_ber_magnitude;/* 0x4a */
	uint8_t		effective_ber_coef;	/* 0x4b bits 0-3 only */
} __attribute__((packed)) mpcnt_counters_t;

typedef struct {
	uint16_t	unused;
	/* bits [8-11] only */
	uint8_t		page_backward_rev;
	/* bits [0-3] only */
	uint8_t		page_current_rev;
	uint32_t	reserved;

	uint32_t	pages_31_00;
	uint32_t	pages_63_32;
	uint32_t	pages_95_64;
	uint32_t	pages_127_96;
	uint32_t	pages_159_128;
	uint32_t	pages_191_160;
	uint32_t	pages_223_192;
	uint32_t	pages_255_224;
} __attribute__((packed)) diag_capabilities_t;

typedef struct {
	uint16_t	unused;
	/* bits [8-11] only */
	uint8_t		page_backward_rev;
	/* bits [0-3] only */
	uint8_t		page_current_rev;
	uint32_t	reserved;

	/* Table 421 - Physical Layer Statistical Counters Data Layout */
	uint32_t	time_since_last_clear_high;
	uint32_t	time_since_last_clear_low;
	uint32_t	phy_received_bits_high;
	uint32_t	phy_received_bits_low;
	uint32_t	phy_symbol_errors_high;
	uint32_t	phy_symbol_errors_low;
	uint32_t	phy_corrected_bits_high;
	uint32_t	phy_corrected_bits_low;
	uint32_t	phy_raw_errors_lane0_high;
	uint32_t	phy_raw_errors_lane0_low;
	uint32_t	phy_raw_errors_lane1_high;
	uint32_t	phy_raw_errors_lane1_low;
	uint32_t	phy_raw_errors_lane2_high;
	uint32_t	phy_raw_errors_lane2_low;
	uint32_t	phy_raw_errors_lane3_high;
	uint32_t	phy_raw_errors_lane3_low;
	uint32_t	phy_raw_errors_lane4_high;
	uint32_t	phy_raw_errors_lane4_low;
	uint32_t	phy_raw_errors_lane5_high;
	uint32_t	phy_raw_errors_lane5_low;
	uint32_t	phy_raw_errors_lane6_high;
	uint32_t	phy_raw_errors_lane6_low;
	uint32_t	phy_raw_errors_lane7_high;
	uint32_t	phy_raw_errors_lane7_low;
	uint16_t	unused1;
	uint8_t		raw_ber_magnitude;	/* 0x62 + 8 */
	uint8_t		raw_ber_coef;		/* bits 0-3 only */
	uint16_t	unused2;
	uint8_t		effective_ber_magnitude;/* 0x66 + 8 */
	uint8_t		effective_ber_coef;	/* bits 0-3 only */
	uint16_t	unused3;
	uint8_t		symbol_ber_magnitude;   /* 0x6A + 8 */
	uint8_t		symbol_fec_ber_coef;	/* bits 0-3 only */
	uint32_t	unused4[4];
	uint32_t	phy_effective_errors_high;
	uint32_t	phy_effective_errors_low;
} __attribute__((packed)) mlx_ppcnt_phy_counters_t;

/* Mellanox Adapters Programmers Reference Manual Table 754 - Module Info Page Layout */
typedef struct {
	uint16_t	unused;
	/* bits [8-11] only */
	uint8_t		page_backward_rev;
	/* bits [0-3] only */
	uint8_t		page_current_rev;
	uint32_t	reserved;

	uint8_t		cable_techno;
	uint8_t		cable_breakout;
	uint8_t		ext_ethernet_compliance_code;
	uint8_t		ethernet_compliance_code;
	uint8_t		cable_type_vendor;
	uint8_t		cable_length;
	uint8_t		cable_identifier;
	uint8_t		cable_power_class;
	uint8_t		unused1;
	uint8_t		cable_rx_amp;
	uint8_t		cable_rx_emphasis;
	uint8_t		cable_tx_equalization;
	uint8_t		unused2;
	uint8_t		cable_attenuation_12g;
	uint8_t		cable_attenuation_7g;
	uint8_t		cable_attenuation_5g;
	uint8_t		unused3;
	uint8_t		rx_tx_cdr_cap;
